{
  "backend/main.mo": "Defines profile, attendance, homework, fee, and message types plus maps for storing histories and teacher/class assignments, along with authorization helpers and profile access utilities.",
  "feature_evidence.json": "Lists feature implementation evidence mapping features to frontend files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Provides short predefined summaries for key frontend files including routing, hooks, pages, and components.",
  "frontend/index.css": "Tailwind base setup with custom OKLCH theme variables for light/dark modes and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication gating, and links to all role-based pages and dashboards.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with header, footer, navigation buttons, logout handling, and optional notification panel.",
  "frontend/src/components/NotificationPanel.tsx": "Slide‑in panel fetching and displaying messages with offline warning and close control.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity loading on mount.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, attendance, and other backend interactions using the actor.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode styles, and print rules.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/ChairpersonLogin.tsx": "Login page for chairperson role using Internet Identity and phone input.",
  "frontend/src/pages/DashboardChairperson.tsx": "Chairperson dashboard showing user stats and a table of all profiles.",
  "frontend/src/pages/DashboardNonTeaching.tsx": "Non‑teaching staff dashboard showing messages and online status alerts.",
  "frontend/src/pages/DashboardStudentParent.tsx": "Displays student dashboard showing attendance, homework, fees, and offline alerts using profile and query hooks.",
  "frontend/src/pages/DashboardTeacher.tsx": "Provides teacher dashboard with class info, attendance marking, and homework creation using related queries.",
  "frontend/src/pages/PhoneOtpLogin.tsx": "Handles phone-based login via Internet Identity, storing role and phone before redirecting.",
  "frontend/src/pages/Profile.tsx": "Shows and updates user profile with editable fields, validation, and undo functionality.",
  "frontend/src/pages/ProfileCompletion.tsx": "Collects initial profile details after login and saves them before routing to the proper dashboard.",
  "frontend/src/pages/RoleSelection.tsx": "Lets users choose a role and navigates them to the login page with the selected role.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, container settings, and adding typography, container-queries, and animation plugins.",
  "project_state.json": "Project state file describing the IEMS app’s goals, architecture notes, required images, and list of implemented features."
}