{
  "backend/main.mo": "Defines core types and state maps for profiles, attendance, homework, fees, and messages, plus helper authorization and role-checking functions.",
  "feature_evidence.json": "Lists feature evidence entries mapping implemented features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for documentation or build-planning use.",
  "frontend/index.css": "Tailwind base styles and theme variables defining light/dark color palettes and global layout tokens.",
  "frontend/index.html": "HTML entrypoint including PWA metadata, manifest link, icons, and script loader for the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, start URL, display mode, and icons.",
  "frontend/public/offline.html": "Static offline fallback page displayed when the app cannot load due to no network connection.",
  "frontend/public/sw.js": "Service worker caching static assets and providing offline navigation fallback handling.",
  "frontend/src/App.tsx": "Main app router configuration with authentication gate, route definitions, and layout wrappers.",
  "frontend/src/components/AppInfoDialog.tsx": "Provides a dialog to view the app URL, copy it, and install the PWA, using clipboard and install prompt hooks.",
  "frontend/src/components/AppLayout.tsx": "Defines the main app layout with header, footer, navigation actions, notifications panel toggle, and logout handling.",
  "frontend/src/components/NotificationPanel.tsx": "Displays a slide‑in panel showing fetched messages, with offline warnings and a close button.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window event listeners.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt events, exposing install capability and state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, messages, attendance, and other backend data with toast feedback.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables with global base styles and print visibility rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ChairpersonLogin.tsx": "Renders a chairperson login form storing phone and role before triggering Internet Identity login.",
  "frontend/src/pages/DashboardChairperson.tsx": "Displays chairperson dashboard stats and a table of all user profiles using query hooks.",
  "frontend/src/pages/DashboardNonTeaching.tsx": "Shows non‑teaching staff dashboard with announcements and offline status alerts.",
  "frontend/src/pages/DashboardStudentParent.tsx": "Presents student dashboard with attendance, homework, fees, and print‑ID functionality.",
  "frontend/src/pages/DashboardTeacher.tsx": "Provides teacher dashboard with class info, attendance marking, and homework creation.",
  "frontend/src/pages/PhoneOtpLogin.tsx": "Handles phone‑based login for any role, storing role and phone before Internet Identity authentication.",
  "frontend/src/pages/Profile.tsx": "Profile page that loads the user’s profile, allows editing name and address, saves changes, and supports undoing the last update.",
  "frontend/src/pages/ProfileCompletion.tsx": "Initial profile setup form that collects name and address, saves the profile, and redirects to the appropriate dashboard.",
  "frontend/src/pages/RoleSelection.tsx": "Landing page that displays role options and navigates the user to login with the selected role.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Metadata file describing project state, features, image requirements, and new feature requests."
}