{
  "kind": "build_request",
  "title": "Make IEMS publish-ready: PWA install + in-app URL sharing",
  "projectName": "IEMS",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add Progressive Web App (PWA) support so IEMS can be installed to a phone home screen (no APK), including a web app manifest, required icons, and basic offline fallback for the app shell.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Publish it"
        ]
      },
      "acceptanceCriteria": [
        "The app provides a valid web app manifest linked from the HTML head.",
        "The app provides at least 192x192 and 512x512 app icons referenced by the manifest.",
        "On supported mobile/desktop browsers, the app is eligible for “Add to Home Screen” / install.",
        "If the user loads the app once while online, a subsequent offline refresh shows a minimal offline page/message rather than a browser error page (data-syncing actions remain blocked as already implemented)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a user-visible way to retrieve and share the deployed app URL from inside the UI (e.g., in a header/footer “App info” area with a copy-to-clipboard button).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Publish it"
        ]
      },
      "acceptanceCriteria": [
        "The UI shows the current app URL (derived from window.location) in a readable, copyable form.",
        "A “Copy link” action copies the full URL and shows a success toast/feedback message.",
        "The URL display is available without requiring developer tools and is accessible from the main app layout."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an install help panel (English text) explaining that IEMS is a web app (no APK) and providing short device-appropriate instructions for installing to the home screen when installation is available, otherwise explaining how to add a home-screen shortcut manually.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Publish it"
        ]
      },
      "acceptanceCriteria": [
        "The install help text explicitly states the app is web-based and does not provide an APK.",
        "When the browser supports install prompting, the UI offers an “Install” action; when not supported, the UI shows manual steps.",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit immutable hook bootstrap files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend remains single-actor; do not introduce additional backend services.",
    "Do not attempt to generate or provide an Android APK; this project is web-only."
  ],
  "nonGoals": [
    "Implementing Android APK packaging or publishing to app stores.",
    "Adding push notifications or real-time WebSocket messaging.",
    "Introducing external databases or third-party auth providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [
      "School crest-style logo with book and laurel, flat vector look, warm green + charcoal palette (iems-logo.dim_512x512.png)",
      "Soft abstract school-themed header background with subtle stationery shapes, light paper texture (iems-header-bg.dim_1600x400.png)",
      "Simple monochrome icon set (attendance checkmark, homework notebook, fees receipt, announcement megaphone) in a consistent line style (iems-icons.dim_256x256.png)",
      "Square app icon, simplified crest mark, warm green + charcoal, centered with padding (iems-app-icon.dim_192x192.png)",
      "Square app icon, simplified crest mark, warm green + charcoal, centered with padding (iems-app-icon.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}