{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "IEMS publish-ready: PWA install + in-app URL sharing",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add PWA installability with manifest, icons, service worker caching, and offline fallback for the app shell.",
      "acceptanceCriteria": [
        "The app provides a valid web app manifest linked from the HTML head.",
        "The app provides at least 192x192 and 512x512 app icons referenced by the manifest.",
        "On supported mobile/desktop browsers, the app is eligible for “Add to Home Screen” / install.",
        "If the user loads the app once while online, a subsequent offline refresh shows a minimal offline page/message rather than a browser error page (data-syncing actions remain blocked as already implemented)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Link the web app manifest from the HTML head and add PWA-related meta tags (e.g., theme color) and icon links to ensure install eligibility and proper home-screen appearance."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Add a valid web app manifest for IEMS (name/short_name, start_url, display=standalone, theme/background colors) and reference the required app icons at frontend/public/assets/generated/iems-app-icon.dim_192x192.png and frontend/public/assets/generated/iems-app-icon.dim_512x512.png."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Implement a minimal service worker that caches the app shell and an offline fallback document on first successful load, and serves the offline fallback for navigation requests when the network is unavailable."
        },
        {
          "path": "frontend/public/offline.html",
          "operation": "create",
          "description": "Provide a minimal offline page/message shown when the app is refreshed while offline (no data-sync actions; just guidance to reconnect)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the service worker from the React app (without modifying frontend/src/main.tsx) so it installs/updates in supported browsers and enables offline fallback after an initial online load."
        },
        {
          "path": "frontend/public/assets/generated/iems-app-icon.dim_192x192.png",
          "operation": "create",
          "description": "Add the generated 192x192 square app icon asset at frontend/public/assets/generated/iems-app-icon.dim_192x192.png and ensure it is referenced by the manifest."
        },
        {
          "path": "frontend/public/assets/generated/iems-app-icon.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated 512x512 square app icon asset at frontend/public/assets/generated/iems-app-icon.dim_512x512.png and ensure it is referenced by the manifest."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Expose the deployed app URL in the main layout with copy-to-clipboard and success feedback.",
      "acceptanceCriteria": [
        "The UI shows the current app URL (derived from window.location) in a readable, copyable form.",
        "A “Copy link” action copies the full URL and shows a success toast/feedback message.",
        "The URL display is available without requiring developer tools and is accessible from the main app layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppInfoDialog.tsx",
          "operation": "create",
          "description": "Create an App Info dialog/panel component that reads the current URL from window.location, renders it in a selectable/copyable form, and provides a “Copy link” action with toast/feedback. Use shadcn-ui dialog/button/input primitives for accessible UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the AppInfoDialog into the main app layout (header or footer) so users can open it from anywhere in the authenticated app and copy the deployed URL without developer tools. Use shadcn-ui Button for the trigger; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an install help panel with English instructions and an install action when prompting is supported.",
      "acceptanceCriteria": [
        "The install help text explicitly states the app is web-based and does not provide an APK.",
        "When the browser supports install prompting, the UI offers an “Install” action; when not supported, the UI shows manual steps.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePwaInstallPrompt.ts",
          "operation": "create",
          "description": "Add a hook that detects PWA install prompt availability (e.g., listening for the install prompt event and tracking installed state where possible) and exposes an Install action callback for the UI."
        },
        {
          "path": "frontend/src/components/AppInfoDialog.tsx",
          "operation": "modify",
          "description": "Extend the App Info dialog/panel to include an English install help section stating IEMS is a web app (no APK), showing an “Install” button when the install prompt is available, and otherwise showing short manual home-screen shortcut instructions for common devices/browsers. Use shadcn-ui alert/accordion/typography-friendly primitives as needed; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Ensure the App Info entry point remains discoverable from the main layout and clearly indicates install guidance is available (without adding new top-level routes)."
        },
        {
          "path": "frontend/public/assets/generated/iems-header-bg.dim_1600x400.png",
          "operation": "create",
          "description": "Add the generated header background image asset at frontend/public/assets/generated/iems-header-bg.dim_1600x400.png and prepare it to be used in the layout/header styling."
        },
        {
          "path": "frontend/public/assets/generated/iems-icons.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated monochrome icon set asset at frontend/public/assets/generated/iems-icons.dim_256x256.png and reference it within the App Info / install help UI (e.g., as a small illustrative image) so it is wired into the app."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire frontend/public/assets/generated/iems-header-bg.dim_1600x400.png into the header area (e.g., as a subtle background) while keeping existing layout structure intact."
        }
      ]
    }
  ]
}